; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v8 ?v3)
             (pred_1 ?v12 ?v10)
             (pred_9 ?v8 ?v10)
             (pred_2 ?v5 ?v8 )
	     (pred_11 ?v8)
             (pred_5 ?v6)
             (pred_4 ?v12)
             (pred_10 ?v10)
             (pred_6 ?v8)
             (pred_3 ?v12)
             (pred_12 ?v8)
             (pred_7 ))



(:action op_3
:parameters (?v2 ?v13 ?v4 ?v7)
:precondition (and (pred_5 ?v2) (pred_5 ?v13) (pred_4 ?v4) (pred_10 ?v7)
          (pred_8 ?v2 ?v13) (pred_1 ?v4 ?v7)
                   (pred_9 ?v13 ?v7) (pred_11 ?v2) 
                   (pred_6 ?v13) (pred_3 ?v4))
:effect (and  (pred_12 ?v13) (not (pred_6 ?v13))))


(:action op_1
:parameters (?v2 ?v9)
:precondition (and (pred_5 ?v2) (pred_5 ?v9)
               (pred_11 ?v2) (pred_8 ?v2 ?v9) (pred_12 ?v9))
:effect (and (pred_11 ?v9) (not (pred_11 ?v2))))

(:action op_4
:parameters (?v2 ?v4)
:precondition (and (pred_5 ?v2) (pred_4 ?v4) 
                  (pred_11 ?v2) (pred_2 ?v4 ?v2) (pred_7 ))
:effect (and (pred_3 ?v4)
   (not (pred_2 ?v4 ?v2)) (not (pred_7 ))))


(:action op_5
:parameters (?v2 ?v11 ?v1)
:precondition (and (pred_5 ?v2) (pred_4 ?v11) (pred_4 ?v1)
                  (pred_11 ?v2) (pred_3 ?v1) (pred_2 ?v11 ?v2))
:effect (and (pred_3 ?v11) (pred_2 ?v1 ?v2)
        (not (pred_3 ?v1)) (not (pred_2 ?v11 ?v2))))

(:action op_2
:parameters (?v2 ?v4)
:precondition (and (pred_5 ?v2) (pred_4 ?v4) 
                  (pred_11 ?v2) (pred_3 ?v4))
:effect (and (pred_7 ) (pred_2 ?v4 ?v2) (not (pred_3 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_18 obj_11 obj_12 obj_07 obj_02 obj_03 obj_20 obj_04 obj_16 obj_06 obj_13 obj_01 obj_17 obj_10 obj_08
    obj_05 obj_09
    obj_14 obj_15
    )

    (:init
       (pred_7)

       (pred_5 obj_19)
       (pred_5 obj_18)
       (pred_5 obj_11)
       (pred_5 obj_12)
       (pred_5 obj_07)
       (pred_5 obj_02)
       (pred_5 obj_03)
       (pred_5 obj_20)
       (pred_5 obj_04)
       (pred_5 obj_16)
       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_01)
       (pred_5 obj_17)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_10 obj_05)
       (pred_10 obj_09)
       (pred_4 obj_14)
       (pred_4 obj_15)

       (pred_8 obj_19 obj_07)
       (pred_8 obj_19 obj_18)
       (pred_8 obj_18 obj_02)
       (pred_8 obj_18 obj_11)
       (pred_8 obj_18 obj_19)
       (pred_8 obj_11 obj_03)
       (pred_8 obj_11 obj_12)
       (pred_8 obj_11 obj_18)
       (pred_8 obj_12 obj_20)
       (pred_8 obj_12 obj_11)
       (pred_8 obj_07 obj_04)
       (pred_8 obj_07 obj_02)
       (pred_8 obj_07 obj_19)
       (pred_8 obj_02 obj_16)
       (pred_8 obj_02 obj_03)
       (pred_8 obj_02 obj_18)
       (pred_8 obj_02 obj_07)
       (pred_8 obj_03 obj_06)
       (pred_8 obj_03 obj_20)
       (pred_8 obj_03 obj_11)
       (pred_8 obj_03 obj_02)
       (pred_8 obj_20 obj_13)
       (pred_8 obj_20 obj_12)
       (pred_8 obj_20 obj_03)
       (pred_8 obj_04 obj_01)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_04 obj_07)
       (pred_8 obj_16 obj_17)
       (pred_8 obj_16 obj_06)
       (pred_8 obj_16 obj_02)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_06 obj_10)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_06 obj_03)
       (pred_8 obj_06 obj_16)
       (pred_8 obj_13 obj_08)
       (pred_8 obj_13 obj_20)
       (pred_8 obj_13 obj_06)
       (pred_8 obj_01 obj_17)
       (pred_8 obj_01 obj_04)
       (pred_8 obj_17 obj_10)
       (pred_8 obj_17 obj_16)
       (pred_8 obj_17 obj_01)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_06)
       (pred_8 obj_10 obj_17)
       (pred_8 obj_08 obj_13)
       (pred_8 obj_08 obj_10)
       (pred_6 obj_18)
       (pred_6 obj_20)
       (pred_9  obj_18 obj_05)
       (pred_9  obj_20 obj_09)
       (pred_12 obj_19)
       (pred_12 obj_11)
       (pred_12 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_02)
       (pred_12 obj_03)
       (pred_12 obj_04)
       (pred_12 obj_16)
       (pred_12 obj_06)
       (pred_12 obj_13)
       (pred_12 obj_01)
       (pred_12 obj_17)
       (pred_12 obj_10)
       (pred_12 obj_08)

       (pred_1  obj_14 obj_05)
       (pred_1  obj_15 obj_09)
       (pred_2 obj_14 obj_02)
       (pred_2 obj_15 obj_16)
       (pred_11 obj_13)
    )

    (:goal (and
       (pred_2 obj_14 obj_10)
       (pred_2 obj_15 obj_12)
    ))
(:constraints
  (always (not (pred_11 obj_06)))
)
)

; plan
1. (op_1 obj_13 obj_08)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_08)
   goals met: 0 of 2
2. (op_1 obj_08 obj_10)
   deleted: (pred_11 obj_08)
   added: (pred_11 obj_10)
   goals met: 0 of 2
3. (op_1 obj_10 obj_17)
   deleted: (pred_11 obj_10)
   added: (pred_11 obj_17)
   goals met: 0 of 2
4. (op_1 obj_17 obj_16)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_16)
   goals met: 0 of 2
5. (op_4 obj_16 obj_15)
   deleted: (pred_2 obj_15 obj_16) (pred_7)
   added: (pred_3 obj_15)
   goals met: 0 of 2
6. (op_1 obj_16 obj_02)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_02)
   goals met: 0 of 2
7. (op_1 obj_02 obj_03)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_03)
   goals met: 0 of 2
8. (op_1 obj_03 obj_11)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_11)
   goals met: 0 of 2
9. (op_1 obj_11 obj_12)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_12)
   goals met: 0 of 2
10. (op_2 obj_12 obj_15)
   deleted: (pred_3 obj_15)
   added: (pred_7) (pred_2 obj_15 obj_12)
   goals met: 1 of 2
11. (op_1 obj_12 obj_11)
   deleted: (pred_11 obj_12)
   added: (pred_11 obj_11)
   goals met: 1 of 2
12. (op_1 obj_11 obj_03)
   deleted: (pred_11 obj_11)
   added: (pred_11 obj_03)
   goals met: 1 of 2
13. (op_1 obj_03 obj_02)
   deleted: (pred_11 obj_03)
   added: (pred_11 obj_02)
   goals met: 1 of 2
14. (op_4 obj_02 obj_14)
   deleted: (pred_2 obj_14 obj_02) (pred_7)
   added: (pred_3 obj_14)
   goals met: 1 of 2
15. (op_1 obj_02 obj_16)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_16)
   goals met: 1 of 2
16. (op_1 obj_16 obj_17)
   deleted: (pred_11 obj_16)
   added: (pred_11 obj_17)
   goals met: 1 of 2
17. (op_1 obj_17 obj_10)
   deleted: (pred_11 obj_17)
   added: (pred_11 obj_10)
   goals met: 1 of 2
18. (op_2 obj_10 obj_14)
   deleted: (pred_3 obj_14)
   added: (pred_7) (pred_2 obj_14 obj_10)
   goals met: 2 of 2
